{
    "id": "text_recipe_1761519307_226",
    "slug": "spooky-ghost-mac-and-cheese",
    "title": "Spooky Ghost Mac and Cheese",
    "promptIMG": "Spooky Ghost Mac and Cheese, on plate, natural food photography, balanced sharp focus, zero blur throughout entire image, infinite depth of field, realistic food textures, modern kitchen background in sharp focus, natural lighting, kitchen countertop visible, even focus distribution, documentary food photography, natural sharpness --no blur, depth of field, bokeh, over-sharpening, artificial enhancement --quality 2 --raw --stylize 300",
    "isOnline": true,
    "description": "Transform your classic mac and cheese into a Halloween delight with spooky ghost-shaped mozzarella. This dish is not only fun but also incredibly creamy and comforting, making it perfect for Halloween gatherings or a cozy night in.",
    "category_id": "cat_1761230749_334",
    "author_id": "author_001",
    "ingredients": [
        "8 ounces elbow macaroni",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "2 cups milk",
        "2 cups shredded cheddar cheese",
        "1 cup mozzarella cheese, cut into ghost shapes",
        "Salt and pepper to taste"
    ],
    "instructions": [
        "Cook macaroni according to package instructions; drain and set aside.",
        "In a large saucepan, melt butter over medium heat. Stir in flour and cook for 1 minute.",
        "Gradually whisk in milk, cooking until thickened. Stir in cheddar cheese until melted.",
        "Combine the cooked macaroni with the cheese sauce, season with salt and pepper.",
        "Transfer to a baking dish, top with ghost-shaped mozzarella, and bake at 350°F for 15 minutes until bubbly."
    ],
    "prep_time": 15,
    "cook_time": 30,
    "total_time": 45,
    "servings": 6,
    "difficulty": "easy",
    "tips": "For the best flavor, use freshly shredded cheese and feel free to add your favorite spices to the cheese sauce.",
    "structured_content": [
        {
            "content": "<p>Get ready to impress your guests with this Spooky Ghost Mac and Cheese! This delightful dish combines the classic comfort of mac and cheese with a fun Halloween twist, making it a perfect centerpiece for your October festivities.<\/p>"
        },
        {
            "note": {
                "label": "Why You'll Love This Recipe",
                "content": "<ul><li>Quick and easy to make in under 45 minutes<\/li><li>Fun and spooky presentation for Halloween<\/li><li>Perfect for Halloween parties and cozy dinners<\/li><li>Uses simple ingredients you likely have on hand<\/li><li>Kids and adults alike will love this playful dish<\/li><\/ul>"
            }
        },
        {
            "content": "<p>I remember the first time I made this for a Halloween party; the kids were thrilled to see ghost-shaped cheese on their plates. It turned a simple dinner into a memorable event filled with laughter and joy.<\/p>"
        },
        {
            "headline": "Gather Your Ingredients"
        },
        {
            "content": "<ul><li><strong>Main ingredient:<\/strong> Elbow macaroni is perfect for holding the creamy cheese sauce.<\/li><li><strong>Key seasonings\/flavoring agents:<\/strong> Salt and pepper enhance the flavors of the cheese.<\/li><li><strong>Supporting ingredients:<\/strong> Mozzarella ghosts add a fun touch and extra creaminess.<\/li><li><strong>Equipment needed:<\/strong> A large saucepan, baking dish, and whisk are essential for this recipe.<\/li><\/ul>"
        },
        {
            "upload": {
                "context": "A colorful display of ingredients for Spooky Ghost Mac and Cheese, showcasing macaroni, cheese, and ghost shapes.",
                "url": "spooky-ghost-mac-and-cheese\/images\/image_1.webp",
                "fileName": "image_1.webp",
                "type": "main"
            }
        },
        {
            "headline": "How to Make It"
        },
        {
            "content": "<dl><dt><strong>Preparation:<\/strong><\/dt><dd>Cook the macaroni according to package instructions, ensuring it's al dente.<\/dd><dt><strong>Cooking\/Baking Process:<\/strong><\/dt><dd>Make the cheese sauce by melting butter, adding flour, and whisking in milk until thick. Stir in the cheddar until melted, then combine with macaroni.<\/dd><dt><strong>Finishing Touches:<\/strong><\/dt><dd>Top with mozzarella ghosts and bake until bubbly for a spooky finish.<\/dd><\/dl>"
        },
        {
            "upload": {
                "context": "Capturing the cooking process of Spooky Ghost Mac and Cheese, highlighting the creamy cheese sauce and ghost shapes.",
                "url": "spooky-ghost-mac-and-cheese\/images\/image_2.webp",
                "fileName": "image_2.webp",
                "type": "process"
            }
        },
        {
            "note": {
                "label": "You Must Know",
                "content": "<ul><li>Ensure the cheese sauce is thick enough to coat the macaroni well.<\/li><li>Avoid overcooking the macaroni to keep it from becoming mushy.<\/li><li>Look for bubbling cheese as a sign that it's ready to serve.<\/li><li>Store leftovers in an airtight container and reheat gently.<\/li><\/ul>"
            }
        },
        {
            "content": "<p>This dish has become a family favorite, especially during Halloween. Sharing it with friends and family brings back memories of laughter and spooky fun.<\/p>"
        },
        {
            "headline": "Flavor Boosters"
        },
        {
            "content": "<p>Consider adding cooked bacon bits or sautéed vegetables for extra flavor and texture. A sprinkle of paprika can also enhance the dish's appearance.<\/p>"
        },
        {
            "headline": "Serving Suggestions"
        },
        {
            "content": "<p>Pair this spooky mac and cheese with a fresh salad or garlic bread for a complete meal. A Halloween-themed beverage can add to the festive spirit!<\/p>"
        },
        {
            "headline": "Creative Variations"
        },
        {
            "content": "<p>For a gluten-free version, use gluten-free pasta. You can also swap the cheeses for dairy-free alternatives to make it vegan-friendly.<\/p>"
        },
        {
            "upload": {
                "context": "The final plated Spooky Ghost Mac and Cheese, showcasing the ghost shapes and creamy texture, perfect for Halloween.",
                "url": "spooky-ghost-mac-and-cheese\/images\/image_3.webp",
                "fileName": "image_3.webp",
                "type": "final"
            }
        },
        {
            "note": {
                "label": "Pro Tips",
                "content": "<ul><li>For a richer flavor, use a combination of cheeses.<\/li><li>Prep your ingredients ahead of time for a smoother cooking experience.<\/li><li>Keep an eye on the baking time to prevent burning the cheese.<\/li><li>Garnish with fresh herbs for a pop of color.<\/li><\/ul>"
            }
        },
        {
            "content": "<p>Don't be afraid to get creative with this dish! Cooking should be fun, and this Spooky Ghost Mac and Cheese is sure to bring smiles to your table.<\/p>"
        }
    ],
    "images": [
        {
            "fileName": "image_1.webp",
            "filePath": "recipes\/spooky-ghost-mac-and-cheese\/images\/image_1.webp",
            "relativePath": "spooky-ghost-mac-and-cheese\/images\/image_1.webp",
            "originalUrl": "http:\/\/localhost\/SitePinterset\/mollykitchendaily-main\/tmpIMG\/image_1.webp",
            "order": 1,
            "type": "main"
        },
        {
            "fileName": "image_2.webp",
            "filePath": "recipes\/spooky-ghost-mac-and-cheese\/images\/image_2.webp",
            "relativePath": "spooky-ghost-mac-and-cheese\/images\/image_2.webp",
            "originalUrl": "http:\/\/localhost\/SitePinterset\/mollykitchendaily-main\/tmpIMG\/image_2.webp",
            "order": 2,
            "type": "process"
        },
        {
            "fileName": "image_3.webp",
            "filePath": "recipes\/spooky-ghost-mac-and-cheese\/images\/image_3.webp",
            "relativePath": "spooky-ghost-mac-and-cheese\/images\/image_3.webp",
            "originalUrl": "http:\/\/localhost\/SitePinterset\/mollykitchendaily-main\/tmpIMG\/image_3.webp",
            "order": 3,
            "type": "final"
        },
        {
            "fileName": "spooky-ghost-mac-and-cheese_image_4.webp",
            "filePath": "recipes\/spooky-ghost-mac-and-cheese\/images\/spooky-ghost-mac-and-cheese_image_4.webp",
            "relativePath": "spooky-ghost-mac-and-cheese\/images\/spooky-ghost-mac-and-cheese_image_4.webp",
            "originalUrl": "http:\/\/localhost\/SitePinterset\/mollykitchendaily-main\/recipes\/spooky-ghost-mac-and-cheese\/images\/spooky-ghost-mac-and-cheese_image_4.webp",
            "order": 4,
            "type": "template"
        }
    ],
    "image": "image_1.webp",
    "image_path": "recipes\/spooky-ghost-mac-and-cheese\/images\/image_1.webp",
    "image_dir": "spooky-ghost-mac-and-cheese\/images",
    "generated_from_text": true,
    "has_rich_structure": true,
    "createdAt": "2025-10-26T23:55:07+01:00",
    "updatedAt": "2025-10-26T23:55:07+01:00"
}